target/test-classes/rakuten/zeromanual/testdate/request/GetHotelInformationRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://travel.rakuten.co.jp/rconnect/schemas">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderesponsetand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>#(credential.rcv3.username)</wsse:Username>
                <wsse:Password>#(credential.rcv3.password)</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <sch:GetHotelInformationRQ>
            <sch:hotelNo>#(hotelNo)</sch:hotelNo>
        </sch:GetHotelInformationRQ>
    </soapenv:Body>
</soapenv:Envelope>